# SetupDockablePane Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDockablePaneProvider..::..SetupDockablePane Method
IDockablePaneProvider Interface See Also
---
Method called during initialization of the user interface to gather information about a dockable pane window.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
void SetupDockablePane(
	DockablePaneProviderData data
)
```

Visual Basic
---
```text
Sub SetupDockablePane ( _
	data As DockablePaneProviderData _
)
```

Visual C++
---
```text
void SetupDockablePane(
	DockablePaneProviderData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.UI..::..DockablePaneProviderData Container for information about the new dockable pane. Implementers should set the FrameworkElement and InitialState Properties. Optionally, providers can set the ContextualHelp property if they wish to provide or react to help requests on the pane, or override the default EditorInteraction property by setting it here.
# See Also
IDockablePaneProvider Interface
Autodesk.Revit.UI Namespace